tutorials/cases/MicroTGA-DEM_Us_UsInterp/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler; 
}

gradSchemes
{
    default         Gauss linear; 
}

divSchemes
{
    default         none;

    div(phi,U)      Gauss linearUpwindV default;
    div(phi,Yi)     Gauss upwind;
    div(phi,h)      Gauss upwind;
    div(phi,K)      Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(phiSolid) Gauss SuperBee ;
    div(porPhi) Gauss SuperBee ;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;

    rhoCpInt        localMax;
    porosityInt     localMin;
}

snGradSchemes
{
    default         orthogonal;
}

// ************************************************************************* //
