tutorials/cases/MicroTGA-DEM_Us_UsInterp/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


defaultFieldValues
(
);

regions
(
    boxToCell
    {
        box (-0.0051 -0.0051 -0.0101) (0.0051 0.0051 0.0101);
        fieldValues
        (
            volScalarFieldValue porosityF 0.85
            volScalarFieldValue porosityF0 0.85
            volScalarFieldValue T 305
        );
    }
);



// ************************************************************************* //
