tutorials/cases/MicroTGA-DEM_Us_UsInterp/Allrun
#!/bin/bash
blockMesh

cp -r 0_orig 0
setFields
decomposePar
mkdir -p spheres

mpirun --allow-run-as-root -n 2 yade MPI_lambda.py
